rkz/extension/Catalogs/СерииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СерииНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Цвет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Цвета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Партия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ВидЗаказа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ТипОбшивкиБарабана</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ТипБарабана</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Брутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ВесПродукции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ВесОбшивки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ВесБарабана</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ПрежнийНомерТары</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_НомерЗаказа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Намотки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ПереченьДлинНаБарабане</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Длина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

rkz/extension/Catalogs/СерииНоменклатуры/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&Перед("ПриСозданииНаСервере") 
&НаСервере
Процедура бит_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)

	// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 +
	Если Элементы.Найти("бит_ГруппаДополнительныеРеквизиты") = Неопределено Тогда
		бит_СоздатьЭлементыБит(); 
	КонецЕсли;
	// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 -  
	
КонецПроцедуры 

&После("ПриСозданииНаСервере") 
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ9.5 вывод реквизитов серии] [ASHolyavko@1cbit.ru] [16.05.2025] +        
	
	Элементы.Номер.Заголовок = "№ Барабана"; 
	Элементы.ДатаПроизводства.Заголовок = "Дата акта";

	
	//Если ЭтаФорма.Элементы.Найти("бит_Намотки") = Неопределено Тогда             //ГдеРазместить
	//	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_Намотки", Тип("ПолеФормы"), ,Неопределено);
	//	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	//	НовыйЭлемент.ПутьКДанным = "Объект.бит_Намотки";
	//КонецЕсли;
	
	//Если ЭтаФорма.Элементы.Найти("бит_Брутто") = Неопределено Тогда             //ГдеРазместить
	//	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_Брутто", Тип("ПолеФормы"), ,Неопределено);
	//	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	//	НовыйЭлемент.ПутьКДанным = "Объект.бит_Брутто";
	//КонецЕсли;
	
	//Если ЭтаФорма.Элементы.Найти("бит_Примечание") = Неопределено Тогда             //ГдеРазместить
	//	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_Примечание", Тип("ПолеФормы"), ,Неопределено);
	//	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	//	НовыйЭлемент.ПутьКДанным = "Объект.бит_Примечание";
	//КонецЕсли;
	
	//Если ЭтаФорма.Элементы.Найти("бит_Тара") = Неопределено Тогда             //ГдеРазместить
	//	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_Тара", Тип("ПолеФормы"), ,Неопределено);
	//	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	//	НовыйЭлемент.ПутьКДанным = "Объект.бит_Тара";
	//КонецЕсли;
	
	//Если ЭтаФорма.Элементы.Найти("бит_ПрежнийНомерТары") = Неопределено Тогда             //ГдеРазместить
	//	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_ПрежнийНомерТары", Тип("ПолеФормы"), ,Неопределено);
	//	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	//	НовыйЭлемент.ПутьКДанным = "Объект.бит_ПрежнийНомерТары";
	//КонецЕсли;
	
	Если ЭтаФорма.Элементы.Найти("бит_Партия") = Неопределено Тогда             //ГдеРазместить
		НовыйЭлемент = Этаформа.Элементы.Вставить("бит_Партия", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.бит_Партия";
	КонецЕсли;
	
	Если ЭтаФорма.Элементы.Найти("бит_Цвет") = Неопределено Тогда             //ГдеРазместить
		НовыйЭлемент = Этаформа.Элементы.Вставить("бит_Цвет", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.бит_Цвет";
	КонецЕсли;
	
	Если ЭтаФорма.Элементы.Найти("бит_ТипОбшивкиБарабана") = Неопределено Тогда             //ГдеРазместить
		НовыйЭлемент = Этаформа.Элементы.Вставить("бит_ТипОбшивкиБарабана", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.бит_ТипОбшивкиБарабана";
	КонецЕсли; 
	
	Если ЭтаФорма.Элементы.Найти("бит_ВидЗаказа") = Неопределено Тогда             //ГдеРазместить
		НовыйЭлемент = Этаформа.Элементы.Вставить("бит_ВидЗаказа", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.бит_ВидЗаказа";
	КонецЕсли;
    // }}ПервыйБИТ ЛистТребований [ЛТ9.5 вывод реквизитов серии] [ASHolyavko@1cbit.ru] [16.05.2025] -
		
	// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 +
	бит_ГруппаДополнительныеРеквизитыВидимость = Ложь;
	Для Каждого Подчиненные Из Элементы.бит_ГруппаДополнительныеРеквизиты.ПодчиненныеЭлементы Цикл
		Если Подчиненные.Видимость = Истина Тогда
			бит_ГруппаДополнительныеРеквизитыВидимость = Истина;
		КонецЕсли;
	КонецЦикла;
	Элементы.бит_ГруппаДополнительныеРеквизиты.Видимость = бит_ГруппаДополнительныеРеквизитыВидимость; 
	// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 - 
	
КонецПроцедуры

//&Перед("ПриЧтенииСозданииНаСервере")
//&НаСервере
//Процедура бит_ПриЧтенииСозданииНаСервереПеред() 
//	
//	// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 +
//	//Если Элементы.Найти("бит_ГруппаДополнительныеРеквизиты") = Неопределено Тогда  
//	//	бит_СоздатьЭлементыБит();	
//	//КонецЕсли;
//	// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 -
//	
//КонецПроцедуры

&НаСервере
Процедура бит_СоздатьЭлементыБит()

	// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 +
	НоваяГруппа  = Элементы.Добавить("бит_ГруппаДополнительныеРеквизиты",Тип("ГруппаФормы"), ЭтаФорма);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.ОтображатьЗаголовок = Истина; 
	НоваяГруппа.Заголовок = "(бит) Дополнтельно";  
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;  
	//НоваяГруппа.Группировка = ГруппировкаКолонок.Вертикальная;
	
	//(бит) № заказа
	Если ЭтаФорма.Элементы.Найти("бит_НомерЗаказа") = Неопределено Тогда 
		НовыйЭлемент = Элементы.Вставить("бит_НомерЗаказа", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.бит_НомерЗаказа";
	КонецЕсли;

	//(бит) Намотки 
	Если ЭтаФорма.Элементы.Найти("бит_Намотки") = Неопределено Тогда
		НовыйЭлемент = Элементы.Вставить("бит_Намотки", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.бит_Намотки";
	КонецЕсли;
	
	//(бит) Брутто, кг 
	Если ЭтаФорма.Элементы.Найти("бит_Брутто") = Неопределено Тогда
		НовыйЭлемент = Элементы.Вставить("бит_Брутто", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.бит_Брутто";
	КонецЕсли;

	//(бит) Примечание
	Если ЭтаФорма.Элементы.Найти("бит_Примечание") = Неопределено Тогда
		НовыйЭлемент = Элементы.Вставить("бит_Примечание", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.бит_Примечание";
	КонецЕсли;

	//(бит) Тара
	Если ЭтаФорма.Элементы.Найти("бит_ТипБарабана") = Неопределено Тогда
		НовыйЭлемент = Элементы.Вставить("бит_ТипБарабана", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.бит_ТипБарабана";
	КонецЕсли;

	//(бит) Прежний № тары 
	Если ЭтаФорма.Элементы.Найти("бит_ПрежнийНомерТары") = Неопределено Тогда
		НовыйЭлемент = Элементы.Вставить("бит_ПрежнийНомерТары", Тип("ПолеФормы"), Элементы.бит_ГруппаДополнительныеРеквизиты, Неопределено);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.бит_ПрежнийНомерТары";
	КонецЕсли;
    // Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025 - 
	
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("УстановитьНастройкиПоШаблону")
Процедура бит_УстановитьНастройкиПоШаблону()

	РежимОтладки = ОбщегоНазначенияУТ.РежимОтладки();

	ПараметрыПолитики = Новый ФиксированнаяСтруктура(Справочники.ВидыНоменклатуры.НастройкиИспользованияСерий(Объект.ВидНоменклатуры));

	Для Каждого Описание Из ПараметрыПолитики.ОписанияИспользованияРеквизитовСерии Цикл
		#Вставка     
		// {{ПервыйБИТ ЛистТребований [ЛТ5.37доп]  [VUVaynula@1cbit.ru] [06.06.2025 12:12:53] +        
		Если Элементы.Найти(Описание.ИмяРеквизита) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		// }}ПервыйБИТ ЛистТребований [ЛТ5.37доп]  [VUVaynula@1cbit.ru] [06.06.2025 12:12:53] -
		#КонецВставки

		Элементы[Описание.ИмяРеквизита].Видимость = Описание.Использование;

		Если Не ПустаяСтрока(Описание.Формат) Тогда
			Элементы[Описание.ИмяРеквизита].Формат               = Описание.Формат;
			Элементы[Описание.ИмяРеквизита].ФорматРедактирования = Описание.Формат;
		КонецЕсли;

	КонецЦикла;


	МожноМенятьНомер = РежимОтладки
	Или Не Элементы.RFIDTID.Видимость
	Или Не ((ЗначениеЗаполнено(Объект.RFIDTID)
	Или ЗначениеЗаполнено(Объект.RFIDEPC))
	И Не Объект.RFIDМеткаНеЧитаемая);

	Элементы.Номер.ТолькоПросмотр = Не МожноМенятьНомер;

	Элементы.RFIDTID.ТолькоПросмотр = Не РежимОтладки;
	Элементы.RFIDUser.ТолькоПросмотр = Не РежимОтладки;
	Элементы.RFIDEPC.ТолькоПросмотр = Не РежимОтладки;
	Элементы.RFIDМеткаНеЧитаемая.ТолькоПросмотр = Не РежимОтладки;

КонецПроцедуры

&НаСервере
Процедура бит_ПриЧтенииНаСервереПеред(ТекущийОбъект)
	Если Элементы.Найти("бит_ГруппаДополнительныеРеквизиты") = Неопределено Тогда  
		бит_СоздатьЭлементыБит();	
	КонецЕсли;
КонецПроцедуры
